CREATE TABLE sales (
    id INI PRIMARY KEY,      -- شماره یکتا برای هر خرید
    customer_name TEXT,      -- اسم مشتری
    product TEXT,            -- محصول
    quantity INT,            -- تعداد
    price FLOAT,             -- قیمت واحد
    date DATE                -- تاریخ خرید
);

-- این بخش برای درست کردن یه قالب جدیده احتمالا و به ترتیب اسم المان ها و نوع و تایپشون رو نوشتیم.
-- این دستور می گه یه جدول به این اسم درست کن که این ها ستون هاش باشن.
-- id کلید اصلی باشه یعنی هر ردیف یکتا.

INSERT INTO sales VALUES 
(1, "Arad", "Laptop", 1, 800.0, "2025-08-01"),
(2, "Sara", "Headphones", 2, 50.0, "2025-08-02"),
(3, "Reza", "Keyboard", 1, 100.0, "2025-08-02"),
(4, "Arad", "Mouse", 3, 25.0, "2025-08-03");

-- اینجا به همون قالب یا جدولی که درست کردیم یکسری مقدار اضافه می کنیم.
-- برای تست کردن چندتا ردیف داده وارد می کنیم. 
-- هر پرانتز یک ردیف داده است.

SELECT * FROM sales;

-- این دستوری هست برای انتخاب کردن یک ستون از یک جدول (فکر کنم...).
-- کوئری های پایه (خواندن داده ها).
-- نمایش همه ستون ها و ردیف ها.
-- * یعنی همه ستون ها.

SELECT customer_name, product FROM sales;

-- اینجا ستون های اسم برده شده رو از جدولی که درست کرده بودیم انتخاب می کنیم.
-- نمایش فقط اسم مشتری و محصول.
-- می تونیم انتخاب کنیم کدوم ستون ها رو ببینیم.

SELECT * FROM sales WHERE customer_name = "Arad";

-- اینجا یعنی همه ستون هایی رو که مربوط به بخشی هستن که اسم = "Arad" هست رو انتخاب می کنیم.
-- فیلتر کردن داده ها (فقط خریدهای آراد).
-- WHERE برای شرط استفاده می شه.

SELECT * FROM sales ORDER BY price DESC;

-- فکر کنم اینجا اینطوریه که قیمت ها رو از جدول انتخاب می کنیم و بر اساس ترتیب مرتب می کنیم.
-- مرتب سازی بر اساس قیمت نزولی.
-- ORDER BY مرتب می کنه. DESC یعنی نزولی و از بزرگ به کوچک.

SELECT COUNT(*) FROM sales;

-- اینو نمی دونم هنوز شاید واسه شمردن باشه طوری که از اسمش پیداست؟!... 
-- تعداد کل ردیف ها رو می شمره.
-- COUNT(*) تعداد ردیف ها رو می ده.

SELECT SUM(qauntity * price) As total_sales FROM sales;

-- کوئری های تحلیلی: مجموع فروش کل(تعداد * قیمت).
-- SUM() جمع می کنه. اینجا داریم تعداد * قیمت هر خرید رو حساب می کنیم.

SELECT customer_name, SUM(quantity * price) AS total_sales
FROM sales
GROUP BY customer_name;

-- اینجا داره مجموع فروش رو حساب می کنه فکر کنم...
-- کوئری های تحلیلی: مجموع فروش هر مشتری.
-- GOUP BY یعنی داده ها رو بر اساس هر مشتری دسته بندی کن.
-- SUM() هم مجموع هر دسته رو می ده.